# Imports préalables pour visualisation pratique

In [1]:
import pandas as pd
pd.set_option("display.max_columns", None )
data = pd.read_csv("titanic.csv")

# Python

#### .append() apprentissage d'élément à une liste

In [2]:
liste_chiffre = [1, 2, 3, 4, 5]
a_ajouter = "Xavier"

liste_chiffre.append(a_ajouter)
liste_chiffre

[1, 2, 3, 4, 5, 'Xavier']

In [3]:
# une liste peut apprendre une autre liste comme élément
liste_chiffre_2 = [1, 2, 3, 4, 5]
a_ajouter_2 = ["Xavier, Gerald"]

liste_chiffre_2.append(a_ajouter_2)
liste_chiffre_2

[1, 2, 3, 4, 5, ['Xavier, Gerald']]

#### .extend() ajoute une 2ème liste à la suite de la première

In [4]:
liste_chiffre_3 = [1, 2, 3, 4, 5]
liste_chiffre_4 = [6,7,8,9,10]

liste_chiffre_3.extend(liste_chiffre_4)
liste_chiffre_3

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

#### .remove() supprime l'élement de la liste sélectionné

In [5]:
liste_chiffre = [1, 2, 3, 4, 5]

liste_chiffre.remove(1)
liste_chiffre

[2, 3, 4, 5]

#### .pop() supprime l'élément par rapport à son index en partant de 0
mais il permet également de stocker la valeur supprimée dans une variable

In [6]:
list_chiffre = [1, 2, 3, 4, 5]

list_chiffre.pop(3)
list_chiffre

[1, 2, 3, 5]

In [7]:
# stockage du pop dans une variable
list_chiffre = [1, 2, 3, 4, 5]

a_stocker = list_chiffre.pop(3)

print(a_stocker)
print(list_chiffre)

4
[1, 2, 3, 5]

# Pandas

In [8]:
data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### .rename permet de renommer les index, colonne et lignes
ci-dessous cas d'usage modifiant le header de la colonne "Name"

In [9]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [10]:
df_exemple_rename = data.rename(columns = {"Name" : "Nom"})

In [11]:
df_exemple_rename.head(1)

,PassengerId,Survived,Pclass,Nom,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

#### .astype() permet de modifier la nature du Dtype "string", "int64", "float", Dtype, etc...
ci-dessous cas d'usage de passage d'un id détecté "int64" pour un passage en "string"

In [12]:
data["PassengerId"].dtypes

dtype('int64')

In [13]:
data["PassengerId"] = data["PassengerId"].astype("string")

In [14]:
data["PassengerId"].dtypes

string[python]

#### .drop() permet de supprimer des colonnes ou lignes
ci-dessous un cas d'usage pour une colonne déterminé comme inutile

In [15]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [16]:
df_exemple_drop = data.drop(columns= ["Ticket"])

In [17]:
df_exemple_drop.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.25,NaN,S

#### .dropna() permet de supprimer des lignes contenant des valeurs null
ci-dessous un cas d'usage pour des lignes déterminées comme inutiles en fonction de leurs valeurs null dans la colonne "Cabin" !!! supprime toutes les lignes !!! cf "Age" ou "Cabin" ci-dessous

In [18]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [19]:
df_exemple_drop = data.dropna(subset= "Cabin")

In [20]:
df_exemple_drop.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            19
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin           0
Embarked        2
dtype: int64

#### .fillna() remplace les valeurs nulles par celle choisie

In [21]:
data["Age"] = data["Age"].fillna(data["Age"].median())

In [22]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### .replace() remplace la valeur spécifiée par celle choisie

In [23]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [24]:
data["Cabin"] = data["Cabin"].replace("C85",  "C88")

In [25]:
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

#### .str.split() sépare les chaînes de caractères en fonction du spérateur spécifié

In [26]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C88,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [27]:
# nécessite le passage en Dtype str si pas le cas
data["Name"]= data["Name"].astype("string")

data["Name_test"] = data["Name"].str.split(",") # renvoi une liste en fonction du séparateur ici espace " "

print(type(data["Name_test"][1]))
print(data["Name_test"][1]) # a la ligne 1 de la colonne la valeur est donc remplacée par une liste

<class 'list'>
['Cumings', ' Mrs. John Bradley (Florence Briggs Thayer)']

In [28]:
# pour créer ou ne garder que la première valeur on expand avec sélection dans la liste séparer ici 0 pour le 1er élément
data["Name"] = data["Name"].str.split(",", n = 1, expand= True)[0]

In [29]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_test
0,1,0,3,Braund,male,22.0,1,0,A/5 21171,7.2500,NaN,S,"[Braund, Mr. Owen Harris]"
1,2,1,1,Cumings,female,38.0,1,0,PC 17599,71.2833,C88,C,"[Cumings, Mrs. John Bradley (Florence Briggs ..."
2,3,1,3,Heikkinen,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"[Heikkinen, Miss. Laina]"

In [30]:
data = pd.read_csv("titanic.csv")

#### pd.DataFrame() transforme une série en dataframe

In [31]:
variable_valeurs_nulles = data.isna().sum()
variable_valeurs_nulles

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [32]:
type(variable_valeurs_nulles)

pandas.core.series.Series

In [33]:
df_valeurs_nulles = pd.DataFrame(variable_valeurs_nulles)
df_valeurs_nulles

               0
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age          177
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin        687
Embarked       2

#### .T et .transpose() transpose lignes et colonnes du df
reprise du df_valeurs_nulles pour illustrer

In [34]:
df_valeurs_nulles.T

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,0,0,0,177,0,0,0,0,687,2

In [35]:
df_valeurs_nulles.transpose()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,0,0,0,177,0,0,0,0,687,2

#### pd.concat fusion de lignes 
dans cet exemple va fusionner 2 df qui ont les mêmes headers

In [36]:
# liste_df = [df_1,df_2]
# df = pd.concat(liste_df, ignore_index = True)

#### pd.merge fusion de df
nécessite en amont de s'assurer d'une clef de jointure sur colonne des df

In [37]:
# fusion en left join du jeux d'enrichissement sur dataset principal
# df_final = pd.merge(df_1, df_2, on= "colonne", how= "left")

#### pd.todatetime() confère le format dtype date

In [38]:
# pas d'exemple avec le dataset
''' df['date'] = pd.to_datetime(df['date'].str[:10], errors='coerce') '''

" df['date'] = pd.to_datetime(df['date'].str[:10], errors='coerce') "

#### passage du postdate au datetime pour lambda passage timestamp

In [39]:
# passage du postdate au datetime pour lambda passage timestamp
# pas d'exemple avec le dataset
''' df["timestamp"] = pd.to_datetime(df["postdate"]).apply(lambda x :
                                       float(x.timestamp())) '''

' df["timestamp"] = pd.to_datetime(df["postdate"]).apply(lambda x :\n                                       float(x.timestamp())) '

#### lambda row à illustrer

In [40]:
# utilisation de lambda row si plage KO prend le statut de l'évaluation de série
''' df_final["QS_TCD"] = df_final.apply(lambda row:
                                            row["QS_TCD_1-<x>+2"]
                                            if row["QS_TCD_N-<x"] == "KO"
                                            else "OK",
                                             axis = 1 )'''

' df_final["QS_TCD"] = df_final.apply(lambda row:\n                                            row["QS_TCD_1-<x>+2"]\n                                            if row["QS_TCD_N-<x"] == "KO"\n                                            else "OK",\n                                             axis = 1 )'

# Numpy

In [41]:
import numpy as np

In [42]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### np.where filtre en fonction des conditions demandées
plus rapide en performance qu'un masque standard

In [43]:
mask_hommes_mineurs = np.where((data["Sex"] == "male") & (data["Age"] < 18))
df_hommes_mineurs = data.loc[mask_hommes_mineurs]

In [44]:
df_hommes_mineurs.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S